Same behaviour in my case, here some informations if it can help:

- fresh imported rke config/state from existing cluster (rke 1.1.3/1.18.3)
- using cluster_yaml argument to existing yaml
- everything is fine, but exactly the same config elements still in "update in-place" state

i was able to remove perpetual update on the three `cluster_*` params by adding this config: 
```
  services {
    kube_controller {
      cluster_cidr = "10.42.0.0/16"
    }
  }
```

Another fresh cluster deployed from terraform and regular arguments (not cluster_yaml) did not have this behaviour when no change are expected, but if i had a new config, the same configurations items are listed for update

Added configuration (No change detected on previous plan) :
```
  services {
    kube_api {
      secrets_encryption_config {
        enabled = true
      }
    }
  }
```

Plan:
```
  ~ update in-place
  # rke_cluster.kube_admin will be updated in-place
  ~ resource "rke_cluster" "kube_admin" {
      ~ cluster_cidr              = "10.42.0.0/16" -> (known after apply)
      ~ cluster_dns_server        = "10.43.0.10" -> (known after apply)
      ~ cluster_domain            = "cluster.local" -> (known after apply)
      ~ kube_config_yaml          = (sensitive value)
      ~ rke_cluster_yaml          = (sensitive value)
      ~ rke_state                 = (sensitive value)
      ~ services {
          ~ kube_api {
              + secrets_encryption_config {
                  + enabled = true
```

Both clusters are using : 
- Terraform 0.12.29
- RKE Provider 1.0.1
- Kubernetes 1.18.3

